Feature: 使用者進入商品販售頁面進行操作

    Rule: 使用者輸入商品ID

        Scenario: 使用者輸入已存在商品ID，加入商品資訊列表
            Given 使用者有效登入
              And 系統存在以下商品
              | 商品ID        | 商品名稱   | 價格 |
              | 1000000000001 | 測試商品01 | 100 |
              | 1000000000002 | 測試商品02 | 200 |
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
             When 使用者輸入存在的商品ID"1000000000002"
             Then 商品列表更新以下資訊
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |

        Scenario: 使用者輸入不存在商品ID，顯示商品不存在訊息
            Given 使用者有效登入
              And 系統存在以下商品
              | 商品ID        | 商品名稱   | 價格 |
              | 1000000000001 | 測試商品01 | 100 |
              | 1000000000002 | 測試商品02 | 200 |
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
             When 使用者輸入存在的商品ID"1000000000003"
             Then 系統顯示商品不存在訊息
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |

        Scenario: 使用者輸入商品資訊列表中已存在的商品ID，系統自動合併數量
            Given 使用者有效登入
              And 系統存在以下商品
              | 商品ID        | 商品名稱   | 價格 |
              | 1000000000001 | 測試商品01 | 100 |
              | 1000000000002 | 測試商品02 | 200 |
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
             When 使用者輸入存在的商品ID"1000000000001"
             Then 商品列表更新以下資訊
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 2   | 200    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |

    Rule: 使用者操作商品列表

        Scenario: 使用者於商品資訊列表中刪除商品行，總價格重新計算
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者於商品資訊列表中刪除商品行"1000000000001"
             Then 商品列表更新以下資訊
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示200
              And 調整價格顯示200
        
        Scenario: 使用者於資訊列表中將商品數量修改為0，系統自動刪除該商品行
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者於資訊列表中修改商品數量"1000000000001"為"0"
             Then 商品列表更新以下資訊
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示200
              And 調整價格顯示200

        Scenario: 使用者於資訊列表中修改商品數量，總價格重新計算
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者於資訊列表中修改商品數量"1000000000001"為"2"
             Then 商品列表更新以下資訊
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 2   | 200    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示400
              And 調整價格顯示400

        Scenario: 使用者於資訊列表中修改商品價格，總價格重新計算
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者於資訊列表中修改調整價格"1000000000001"為"150"
             Then 商品列表更新以下資訊
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 150      | 1   | 150    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示350
              And 調整價格顯示350

        Scenario Outline: 商品數量輸入不合法時恢復原本數量
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者將商品 "1000000000001" 的數量修改為 "<Quantity>"
             Then 商品列表更新以下資訊
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
              
              Examples:
                | Quantity |
                | -1       |
                | abc      |
                | 1.5      |
                
        Scenario Outline: 商品調整價格輸入不合法時恢復原本價格
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者於資訊列表中修改調整價格"1000000000001"為"<Price>"
             Then 商品列表更新以下資訊
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300

              Examples:
                | Price |
                | -1    |
                | abc   |
                | 0     |
                | 1.5   |
                | 1.1.2 |

    Rule: 使用者操作金額資訊區塊

        Scenario: 使用者點擊結帳按鈕後，二次確認訊息顯示並點擊確認後，訂單建立成功
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者點擊結帳按鈕
             Then 顯示二次確認訊息"訂單金額為300"
              And 使用者點擊確認
              And 傳送至後端建立訂單且訂單建立成功
              And 商品列表清空
              And 總價格顯示0
              And 調整價格顯示0
              And 調整價格變更為Disabled
              And 結帳按鈕變更為Disabled
             
        Scenario: 使用者點擊結帳按鈕後，二次確認訊息顯示並點擊取消，訂單未建立，保留原本金額資訊
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者點擊結帳按鈕
             Then 顯示二次確認訊息"訂單金額為300"
              And 使用者點擊取消
              And 訂單資訊未傳送至後端
              And 商品列表保留原本資訊
              And 總價格顯示300
              And 調整價格顯示300

        Scenario: 使用者於調整價格區塊修改價格後，進行訂單送出，訂單建立成功
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
            When 使用者於調整價格區塊修改價格為"400"
             And 使用者點擊結帳按鈕
            Then 顯示二次確認訊息"訂單金額為400"
             And 使用者點擊確認
             And 傳送至後端建立訂單且訂單建立成功
             And 商品列表清空
             And 總價格顯示0
             And 調整價格顯示0
             And 調整價格變更為Disabled
             And 結帳按鈕變更為Disabled

        Scenario: 使用者於調整價格區塊修改價格後，取消訂單送出，訂單未建立，保留原本金額資訊
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者於調整價格區塊修改價格為"400"
              And 使用者點擊結帳按鈕
             Then 使用者點擊結帳按鈕
              And 顯示二次確認訊息"訂單金額為400"
              And 使用者點擊取消
              And 訂單資訊未傳送至後端
              And 商品列表保留原本資訊
              And 總價格顯示300
              And 調整價格顯示400

        Scenario: 使用者於調整價格區塊修改價格後，輸入非數字，系統自動恢復為原本價格
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者於調整價格區塊修改價格為"abc"
             Then 調整價格自動恢復為原本價格
              And 總價格顯示300
              And 調整價格顯示300


        Scenario: 使用者點擊清空按鈕
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者點擊清空按鈕
             Then 商品列表清空
              And 總價格顯示0
              And 調整價格顯示0
              And 調整價格變更為Disabled
              And 結帳按鈕變更為Disabled
        
        Scenario: 使用者送至後端後，回傳非200的Status
            Given 使用者有效登入
              And 目前商品列表顯示如下
              | 商品ID        | 商品名稱   | 價格 | 調整價格 | 數量 | 總價格 |
              | 1000000000001 | 測試商品01 | 100 | 100      | 1   | 100    |
              | 1000000000002 | 測試商品02 | 200 | 200      | 1   | 200    |
              And 總價格顯示300
              And 調整價格顯示300
             When 使用者點擊結帳按鈕
             Then 顯示二次確認訊息"訂單金額為300"
              And 使用者點擊確認
              And 後端回傳非200的Status
              And 顯示錯誤訊息"訂單建立失敗"
              And 訂單建立失敗
              And 商品列表保留原本資訊
              And 總價格顯示300
              And 調整價格顯示300