Feature: 使用者新增產品

    Scenario: 使用者成功新增產品
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
          And Pages顯示為1/1
          When 使用者點擊新增產品按鈕
          And 使用者輸入以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品B | 分類B | 200 | 300 | 20 |
          And 使用者點擊確認新增
         Then 產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
    
    Scenario: 新增產品後，Pages會更新
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品數量為15
          And Pages顯示為1/1
          When 使用者點擊新增產品按鈕
          And 使用者輸入以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品P | 分類P | 100 | 150 | 10 |
          And 使用者點擊確認新增
          Then 目前產品數量為16
          And Pages顯示為2/1
    
    Scenario: 使用者取消新增產品
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
          And Pages顯示為1/1
          When 使用者點擊新增產品按鈕
          And 使用者輸入以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品B | 分類B | 200 | 300 | 20 |
          And 使用者點擊取消新增
          Then 產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
          And Pages顯示為1/1
    
    Scenario: 使用者新增產品時，未輸入必填的產品資料，點擊確認
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
          And Pages顯示為1/1
          When 使用者點擊新增產品按鈕
          And 使用者輸入以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品B |  | 200 | 300 | 20 |
          And 使用者點擊確認新增
          Then 系統顯示錯誤訊息 "請填寫完整的產品資料"
           And 新增產品視窗仍然顯示中
           And 使用者已填寫產品資訊保留
           And 但使用者未填寫的欄位顯示紅框
           And 使用者可以繼續編輯產品資料
    
    Scenario: 使用者新增產品時，API回傳401
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
          And Pages顯示為1/1
          When 使用者點擊新增產品按鈕
          And 使用者輸入以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品B | 分類B | 200 | 300 | 20 |
          And 使用者點擊確認新增
          Then 系統顯示錯誤訊息 "使用者未授權"
           And 將使用者導回登入頁面
    
    Scenario: 使用者新增產品時，API回傳409
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
          And Pages顯示為1/1
          When 使用者點擊新增產品按鈕
          And 使用者輸入以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品B | 分類B | 200 | 300 | 20 |
          And 使用者點擊確認新增
          Then 系統顯示錯誤訊息 "產品已存在"
           And 新增產品視窗仍然顯示中
           And 使用者已填寫產品資訊保留
           And 使用者可以繼續編輯產品資料