Feature: 使用者編輯產品

    Scenario: 使用者成功編輯產品
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
        When 使用者點擊編輯商品按鈕，針對商品編號為1000000000001的商品
          And 使用者修改以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品A-修改 | 分類A-修改 | 150 | 200 | 15 |
          And 使用者點擊確認編輯
          Then 產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A-修改 | 分類A-修改 | 150 | 200 | 15 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
        
    Scenario: 使用者取消編輯產品
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
          When 使用者點擊編輯商品按鈕，針對商品編號為1000000000001的商品
          And 使用者修改以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品A-修改 | 分類A-修改 | 150 | 200 | 15 |
          And 使用者點擊取消編輯
          Then 產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1

    Scenario: 使用者編輯產品時，未輸入必填的產品資料，點擊確認
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
          When 使用者點擊編輯商品按鈕，針對商品編號為1000000000001的商品
          And 使用者修改以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  | 分類A-修改 | 150 | 200 | 15 |
          And 使用者點擊確認編輯
          Then 系統顯示錯誤訊息 "請填寫完整的產品資料"
           And 編輯產品視窗仍然顯示中
           And 使用者已填寫產品資訊保留
           And 但使用者未填寫的欄位顯示紅框
           And 使用者可以繼續編輯產品資料
    
    Scenario: 使用者編輯產品時，API回傳401
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
          When 使用者點擊編輯商品按鈕，針對商品編號為1000000000001的商品
          And 使用者修改以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品A-修改 | 分類A-修改 | 150 | 200 | 15 |
          And 使用者點擊確認編輯
          Then 系統顯示錯誤訊息 "使用者未授權"
           And 將使用者導回登入頁面
    
    Scenario: 使用者編輯產品時，API回傳404
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
          When 使用者點擊編輯商品按鈕，針對商品編號為1000000000001的商品
          And 使用者修改以下產品資料
        |  商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        |  商品A-修改 | 分類A-修改 | 150 | 200 | 15 |
          And 使用者點擊確認編輯
          Then 系統顯示錯誤訊息 "產品不存在"
           And 編輯產品視窗關閉
           And 產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
    
    
