Feature: 使用者刪除產品

    Scenario: 使用者成功刪除產品
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
        When 使用者點擊刪除商品按鈕，針對商品編號為1000000000001的商品
          And 彈出刪除確認視窗
          And 使用者確認刪除
          Then 產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1

    Scenario: 使用者取消刪除產品
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
        When 使用者點擊刪除商品按鈕，針對商品編號為1000000000001的商品
          And 彈出刪除確認視窗
          And 使用者取消刪除
          Then 產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
    
    Scenario: 使用者刪除產品時，API回傳401
        Given 使用者已登入
          And 使用者在產品頁面
          And 目前產品Table顯示以下資料
        | 商品編號 | 商品名稱 | 商品分類 | 成本 | 售價 | 庫存 |
        | 1000000000001 | 商品A | 分類A | 100 | 150 | 10 |
        | 1000000000002 | 商品B | 分類B | 200 | 300 | 20 |
          And Pages顯示為1/1
        When 使用者點擊刪除商品按鈕，針對商品編號為1000000000001的商品
          And 彈出刪除確認視窗
          And 使用者確認刪除
          Then 系統顯示錯誤訊息 "使用者未授權"
           And 將使用者導回登入頁面